W7/D2/MusicApp/Music_App/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save #runs user.save. If true, then:
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"