W7/D2/MusicApp/Music_App/app/models/user.rb

  def generate_unique_session_token
    token = SecureRandom.urlsafe_base64(16)

    while self.class.exists?(session_token: token)
---
SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "uVR84PHr16rRj_0q2-fzqQ"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = generate_unique_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "_kVZaQVCW2tCbAIpFtZAXA"], ["updated_at", "2021-10-12 21:48:00.888847"], ["id", 3]]